# Напишите программу, которая на вход принимает два числа A и B, 
# и возводит число А в целую степень B с помощью рекурсии.
# *Пример:*
# A = 3; B = 5 -> 243 (3⁵)
#     A = 2; B = 3 -> 8 

a = 3
b = 5

a1 = 2
b1 = 3

def multi(a, b):
    if b == 1:
        return a
    elif b != 1:
        return a * (multi(a, b-1))
    
    
print("\u0332".join("ЧИСЛО 'А' В СТЕПЕНИ 'В':"))
print(f"a = {a}, b = {b} => {multi(a, b)}")
print(f"a = {a1}, b = {b1} => {multi(a1, b1)}")


